app/Http/Controllers/eNaryad/NaryadController.php

select "id" from "dict_wardens" where "body"::text like '%%'
select "id" from "dict_substations" where "body"::text like '%%'
---
    public function index(Request $request)
    {
        $searchWarden =  '%'.$request->input('searchWarden').'%';
        $searchTerm =  '%'.$request->input('searchTerm').'%';
        $branch=$this->getBranch();


        if ($branch->id==0)
            {
                $wardenlistid = Warden::where('body','like',$searchWarden)->pluck('id');
                $substationlistid = Substation::where('body','like',$searchTerm)->pluck('id');

select * from "dict_typicaltasks" order by "id" asc
select * from "dict_units" where "branch_id" = 0 order by "id" asc
select * from "dict_wardens" where "branch_id" = 0 order by "id" asc
select * from "dict_adjusters" where "branch_id" = 0 order by "id" asc
select * from "dict_brigade_members" where "branch_id" = 0 order by "id" asc
select * from "dict_brigade_engineers" where "branch_id" = 0 order by "id" asc
---
    public function create(Request $request)
    {
        //$this->mode='create';
        $branch = $this->getBranch();
        $tasks = TypicalTask::orderBy('id')->get();
        $units = Unit::where('branch_id',$branch->id)->orderBy('id')->get();
        $wardens = Warden::where('branch_id',$branch->id)->orderBy('id')->get();
        $adjusters = Adjuster::where('branch_id',$branch->id)->orderBy('id')->get();
        $brig_m_arr = Brigade_Member::where('branch_id',$branch->id)->orderBy('id')->get();
        $brig_e_arr =Brigade_Engineer::where('branch_id',$branch->id)->orderBy('id')->get();

select * from "dict_units" where "dict_units"."id" = 2 limit 1
select * from "dict_wardens" where "dict_wardens"."id" = 2 limit 1
select * from "dict_adjusters" where "dict_adjusters"."id" = 5 limit 1
select * from "dict_brigade_members" where "dict_brigade_members"."id" in ('5', '6')
select * from "dict_brigade_engineers" where "dict_brigade_engineers"."id" in ('2', '3')
select * from "dict_substations" where "dict_substations"."id" = 3 limit 1
select * from "dict_station_types" where "dict_station_types"."id" = 1 limit 1
---
    public function pdf(Naryad $naryad)
    {
        $branch=$this->getBranch();
        $nom_naryad='№ '.$naryad->id;
        $unit_txt = Unit::find($naryad->unit_id)->body;
        $warden_txt =Warden::find($naryad->warden_id)->body.', '.Warden::find($naryad->warden_id)->group;
        $adjuster_txt =Adjuster::find($naryad->adjuster_id)->body.', '.Adjuster::find($naryad->adjuster_id)->group;
        $brigade_txt ='';
        if (isset($this->naryadRecord['brig_m_ch'])) {
         $brigade_txt = Brigade_Member::find(explode(",",$this->naryadRecord['brig_m_ch']));
        }
        $engineers_txt='';
        if (isset($this->naryadRecord['brig_e_ch'])) {
        $engineers_txt = Brigade_Engineer::find(explode(",",$this->naryadRecord['brig_e_ch']));
        }

        $brigade_txt = Brigade_Member::find(explode(",",$naryad->brigade_m));
        $engineers_txt = Brigade_Engineer::find(explode(",",$naryad->brigade_e));

        $substation_txt = Substation::find($naryad->substation_id)->body;
        $substation_type_id = Substation::find($naryad->substation_id)->type_id;
        $substation_type = Station_Type::find($substation_type_id)->body;